<%@ page language="java" contentType="text/html; charset=utf-8"
	pageEncoding="utf-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<!-- <title>铁路运输设备统计应用</title> -->
<script type="text/javascript"src="../resources/echarts/echarts.min.js"></script>
<script type="text/javascript"src="../resources/echarts/china.js"></script>
</head>


<body>
	   <div id="map" style="scroll:no;height:450px;width:100%"></div>
  
</body>
</html>
<script type="text/javascript">

    //地图
    var geoCoordMap = {
    	    '太原东': [112.593207,37.891132],
    	    '太原': [112.594051,37.866573],
    	    '太原南': [112.616909,37.797339],
    	    '晋中': [112.648521,37.692589],
    	    '太谷西': [112.515612,37.454213],
    	    '祁县东': [112.364436,37.329652],
    	    '平遥古城': [112.157805,37.161211],
    	    '介休东': [111.995239,37.059371],
    	    '灵石东': [111.92257,36.885312],
    	    '霍州东': [111.84408,36.570581],
    	    '洪洞西': [111.587282,36.260106],
    	    '临汾西': [111.471595,36.107536],
    	    '襄汾西': [111.343267,35.844532],
    	    '侯马西': [111.294557,35.607621],
    	    '闻喜西': [111.185837,35.342388],
    	    '运城北': [110.989643,35.105332],
    	    '永济北': [110.431154,35.034266],
    	    '大荔': [109.834278,34.904514],
    	    '渭南北': [109.48807,34.542174],
    	    '临潼东': [109.312572,34.454102],
    	    '西安北': [108.946138,34.381683],
    	    
    	    '兰州':[103.857519,36.039586],
    	    '兰州西':[103.665425,36.092568],
    	    '陈官营':[103.603435,36.11368],
    	    '西固城':[103.521829,36.14301],
    	    '坡底下':[103.521829,36.14301],
    	    '河口南':[103.462815,36.169473],
    	    '新屯川':[103.412291,36.352661],
    	    '华家山':[103.406169,36.427897],
    	    '大路':[103.431429,36.287297],
    	    '龙泉寺':[103.394945,36.490755],
    	    '马家坪':[103.370983,36.60973],
    	    '永登':[103.280554,36.726512],
    	    '中堡':[103.216922,36.822805],
    	    '富强堡':[103.151849,36.929983],
    	    '天祝':[103.143052,36.986153],
    	    '打柴沟':[103.00459,37.095834],
    	    '深沟':[102.936324,37.130964],
    	    '岔西滩':[102.862064,37.165028],
    	    '乌鞘岭':[102.825138,37.238154],
    	    '青河':[102.837686,37.254894],
    	    '沙沟台':[102.90429,37.293862],
    	    '龙沟':[102.908824,37.327677],
    	    '柳家台':[102.929503,37.374565],
    	    '古浪':[102.924409,37.485914],
    	    '黄羊镇':[102.844667,37.663198],
    	    '头坝河':[102.769407,37.7656],
    	    '武威南':[102.743749,37.821579],
    	    '武威':[102.629829,37.909681],
    	    '北河':[102.56253,37.955413],
    	    '槐安':[102.512057,38.013143],
    	    '截河坝':[102.44502,38.078966],
    	    '青山堡':[102.255078,38.263062],
    	    '金昌':[102.070266,38.376729],
    	    '平口峡':[101.979304,38.442303],
    	    '玉石':[101.898564,38.477767],
    	    '芨岭':[101.794662,38.536014],
    	    '大青阳口':[101.536492,38.658704],
    	    '马莲井':[101.356302,38.714992],
    	    '独峰顶':[101.298391,38.734149],
    	    '山丹':[101.082411,38.819719],
    	    '东乐':[100.812546,38.852889],
    	    '西屯':[100.727255,38.886814],
    	    '张掖':[100.526354,38.980161],
    	    '平原堡':[100.356884,39.085817],
    	    '临泽':[100.167106,39.163595],
    	    '新华庄':[100.037447,39.18089],
    	    '高台':[99.795897,39.274598],
    	    '骆驼城':[99.543201,39.307668],
    	    '梧桐泉':[99.652445,39.310778],
    	    '许三湾':[99.417112,39.32235],
    	    '元山子':[99.333504,39.331832],
    	    '屯升':[99.219979,39.357231],
    	    '清水':[99.063523,39.360709],
    	    '上河清':[98.861604,39.461456],
    	    '红山堡':[98.651086,39.530113],
    	    '酒泉':[98.458204,39.651245],
    	    '嘉峪关':[98.260046,39.770571],
    	    '黑山湖':[98.043516,39.793817],
    	    '玉门东':[97.934132,39.820883],
    	    '腰泉子':[97.685448,39.947848],
    	    '五华山':[97.418548,39.982183],
    	    '低窝铺':[97.250046,40.147957],
    	    '玉门':[97.050407,40.278646],
    	    '三十里井子':[97.153518,40.205577],
    	    '玉门镇':[97.048888,40.279981],
    	    '军垦':[96.971856,40.34223],
    	    '疏勒河':[96.875515,40.435251],
    	    '河东':[96.773212,40.495547],
    	    '桥湾':[96.648447,40.571526],
    	    '柳沟':[96.444419,40.68485],
    	    '安北':[96.195896,40.79916],
    	    '石板墩':[95.959181,40.922841],
    	    '峡口':[95.735925,41.031211],
    	    '柳园':[95.513554,41.113679],
    	    '小泉东':[95.373756,41.183538],
    	    '大泉':[95.191971,41.295607],
    	    '照东':[94.991789,41.403039],
    	    '红柳河':[94.733418,41.539388],
    	    '天湖':[94.509108,41.646892],
    	    '尾亚':[94.365151,41.79421],
    	    '景峡':[94.322886,41.878756],
    	    '思甜':[94.259731,41.95497],
    	    '红旗村':[93.735921,42.558378],
    	    '山口':[94.132142,42.138457],
    	    '烟墩':[94.018226,42.296557],
    	    '哈密东':[93.941639,42.360378],
    	    '盐泉':[93.844909,42.46217],
    	    '红光':[93.594358,42.78415],
    	    '哈密南':[93.463115,42.777816],
    	    '哈密':[93.513157,42.856523],
    	    '火石泉':[93.382669,42.917833],
    	    '头堡':[93.200261,42.971546],
    	    '二堡':[93.016355,43.017252],
    	    '柳树泉':[92.856153,43.059422],
    	    '雅子泉':[92.534841,43.078871],
    	    '了墩':[92.225879,43.150344],
    	    '十三间房':[91.751927,43.217147],
    	    '大步':[91.601119,43.159584],
    	    '红台':[91.316204,43.155523],
    	    '小草湖':[91.176058,43.181451],
    	    '红旗坎':[90.829039,43.17353],
    	    '鄯善':[90.488799,43.105229],
    	    '红山口':[90.347697,43.106585],
    	    '巴哥':[90.028434,43.089335],
    	    '火焰山':[89.852058,43.087553],
    	    '七泉湖':[89.475654,43.137816],
    	    '煤窑沟':[89.329915,43.16203],
    	    '夏普吐勒':[88.994483,43.173429],
    	    '吐鲁番':[88.881821,43.156702],
    	    '天山':[88.541845,43.21356],
    	    '达板城':[88.336939,43.353044],
    	    '盐湖':[88.127212,43.423683],
    	    '柴窝堡':[87.988438,43.511227],
    	    '三葛庄':[87.802344,43.595926],
    	    '芨芨槽子':[87.649207,43.651298],
    	    '乌拉泊':[87.584612,43.711534],
    	    '乌鲁木齐':[87.591257,43.786363],
    	    '二宫':[87.530278,43.849228],
    	    '乌西':[87.427597,43.874909],
    	    '三坪':[87.325055,43.922493],
    	    '昌吉':[87.201258,43.954339],
    	    '呼图壁':[86.865328,44.15267],
    	    '玛纳斯':[86.202698,44.255071],
    	    '石河子':[86.069642,44.274872],
    	    '乌兰乌苏':[85.820318,44.291465],
    	    '沙湾县':[85.615022,44.327763],
    	    '奎屯东':[85.028134,44.384144],
    	    '奎屯':[84.907216,44.408977],
    	    '奎屯西':[84.882115,44.409838],
    	    '乌苏':[84.724794,44.414802],
    	    '四棵树':[84.201315,44.406314],
    	    '古河':[83.846173,44.478387],
    	    '托托':[83.565044,44.550683],
    	    '精河':[83.031675,44.642531],
    	    '水泉子':[83.011493,44.65164],
    	    '蘑菇滩':[82.850216,44.762992],
    	    '艾比湖':[82.781289,44.820734],
    	    '博乐':[82.66036,44.938552],
    	    '白房子':[82.619244,45.010728],
    	    '乌兰达布森':[82.584045,45.056785],
    	    '阿拉山口':[82.582127,45.17716],
    	    
    	    
    	    '北京南':[116.385037,39.870419],
    	    '亦庄':[116.60843,39.818753],
    	    '永乐':[116.819891,39.646168],
    	    '武清':[117.022594,39.378429],
    	    '天津':[117.216971,39.14224]

    	};

    	var BJData = [
    	    [{name:'太原东'}, {name:'太原',value:'编组站,客运,一级'}],
    	    [{name:'太原'}, {name:'太原南',value:'中间站,客运,特级'}],
    	    [{name:'太原南'}, {name:'晋中',value:'中间站,客运,二级'}],
    	    [{name:'晋中'}, {name:'太谷西',value:'中间站,货运,二级'}],
    	    [{name:'太谷西'}, {name:'祁县东',value:'中间站,货运,三级'}],
    	    [{name:'祁县东'}, {name:'平遥古城',value:'编组站,客运,三级'}],
    	    [{name:'平遥古城'}, {name:'介休东',value:'编组站,客运,二级'}],
    	    [{name:'介休东'}, {name:'灵石东',value:'编组站,货运,二级'}],
    	    [{name:'灵石东'}, {name:'霍州东',value:'编组站,客运,二级'}],
    	    [{name:'霍州东'}, {name:'洪洞西',value:'编组站,客运,二级'}],
    	    
    	    [{name:'洪洞西'}, {name:'临汾西',value:'中间站,货运,二级'}],
    	    [{name:'临汾西'}, {name:'襄汾西',value:'编组站,客运,一级'}],
    	    [{name:'襄汾西'}, {name:'侯马西',value:'编组站,客运,二级'}],
    	    [{name:'侯马西'}, {name:'闻喜西',value:'中间站,客运,二级'}],
    	    [{name:'闻喜西'}, {name:'运城北',value:'编组站,客运,二级'}],
    	    [{name:'运城北'}, {name:'永济北',value:'编组站,货运,二级'}],
    	    [{name:'永济北'}, {name:'大荔',value:'编组站,客运,二级'}],
    	    [{name:'大荔'}, {name:'渭南北',value:'编组站,客运,三级'}],
    	    [{name:'渭南北'}, {name:'临潼东',value:'编组站,客运,二级'}],
    	    [{name:'临潼东'}, {name:'西安北',value:'编组站,客运,一级'}]
    	];

    	var lxData=[
			[{name:'兰州'}, {name:'兰州西',value:'编组站,客运,一级'}],
			[{name:'兰州西'}, {name:'陈官营',value:'编组站,客运,一级'}],
			[{name:'陈官营'}, {name:'西固城',value:'编组站,客运,一级'}],
			[{name:'西固城'}, {name:'坡底下',value:'编组站,客运,一级'}],
			[{name:'坡底下'}, {name:'河口南',value:'编组站,客运,一级'}],
			[{name:'河口南'}, {name:'新屯川',value:'编组站,客运,一级'}],
			[{name:'新屯川'}, {name:'华家山',value:'编组站,客运,一级'}],
			[{name:'华家山'}, {name:'大路',value:'编组站,客运,一级'}],
			[{name:'大路'}, {name:'龙泉寺',value:'编组站,客运,一级'}],
			[{name:'龙泉寺'}, {name:'马家坪',value:'编组站,客运,一级'}],
			[{name:'马家坪'}, {name:'永登',value:'编组站,客运,一级'}],
			[{name:'永登'}, {name:'中堡',value:'编组站,客运,一级'}],
			[{name:'中堡'}, {name:'富强堡',value:'编组站,客运,一级'}],
			[{name:'富强堡'}, {name:'天祝',value:'编组站,客运,一级'}],
			[{name:'天祝'}, {name:'打柴沟',value:'编组站,客运,一级'}],
			[{name:'打柴沟'}, {name:'深沟',value:'编组站,客运,一级'}],
			[{name:'深沟'}, {name:'岔西滩',value:'编组站,客运,一级'}],
			[{name:'岔西滩'}, {name:'乌鞘岭',value:'编组站,客运,一级'}],
			[{name:'乌鞘岭'}, {name:'青河',value:'编组站,客运,一级'}],
			[{name:'青河'}, {name:'沙沟台',value:'编组站,客运,一级'}],
			[{name:'沙沟台'}, {name:'龙沟',value:'编组站,客运,一级'}],
			[{name:'龙沟'}, {name:'柳家台',value:'编组站,客运,一级'}],
			[{name:'柳家台'}, {name:'古浪',value:'编组站,客运,一级'}],
			[{name:'古浪'}, {name:'黄羊镇',value:'编组站,客运,一级'}],
			[{name:'黄羊镇'}, {name:'头坝河',value:'编组站,客运,一级'}],
			[{name:'头坝河'}, {name:'武威南',value:'编组站,客运,一级'}],
			[{name:'武威南'}, {name:'武威',value:'编组站,客运,一级'}],
			[{name:'武威'}, {name:'北河',value:'编组站,客运,一级'}],
			[{name:'北河'}, {name:'槐安',value:'编组站,客运,一级'}],
			[{name:'槐安'}, {name:'截河坝',value:'编组站,客运,一级'}],
			[{name:'截河坝'}, {name:'青山堡',value:'编组站,客运,一级'}],
			[{name:'青山堡'}, {name:'金昌',value:'编组站,客运,一级'}],
			[{name:'金昌'}, {name:'平口峡',value:'编组站,客运,一级'}],
			[{name:'平口峡'}, {name:'玉石',value:'编组站,客运,一级'}],
			[{name:'玉石'}, {name:'芨岭',value:'编组站,客运,一级'}],
			[{name:'芨岭'}, {name:'大青阳口',value:'编组站,客运,一级'}],
			[{name:'大青阳口'}, {name:'马莲井',value:'编组站,客运,一级'}],
			[{name:'马莲井'}, {name:'独峰顶',value:'编组站,客运,一级'}],
			[{name:'独峰顶'}, {name:'山丹',value:'编组站,客运,一级'}],
			[{name:'山丹'}, {name:'东乐',value:'编组站,客运,一级'}],
			[{name:'东乐'}, {name:'西屯',value:'编组站,客运,一级'}],
			[{name:'西屯'}, {name:'张掖',value:'编组站,客运,一级'}],
			[{name:'张掖'}, {name:'平原堡',value:'编组站,客运,一级'}],
			[{name:'平原堡'}, {name:'临泽',value:'编组站,客运,一级'}],
			[{name:'临泽'}, {name:'新华庄',value:'编组站,客运,一级'}],
			[{name:'新华庄'}, {name:'高台',value:'编组站,客运,一级'}],
			[{name:'高台'}, {name:'骆驼城',value:'编组站,客运,一级'}],
			[{name:'骆驼城'}, {name:'梧桐泉',value:'编组站,客运,一级'}],
			[{name:'梧桐泉'}, {name:'许三湾',value:'编组站,客运,一级'}],
			[{name:'许三湾'}, {name:'元山子',value:'编组站,客运,一级'}],
			[{name:'元山子'}, {name:'屯升',value:'编组站,客运,一级'}],
			[{name:'屯升'}, {name:'清水',value:'编组站,客运,一级'}],
			[{name:'清水'}, {name:'上河清',value:'编组站,客运,一级'}],
			[{name:'上河清'}, {name:'红山堡',value:'编组站,客运,一级'}],
			[{name:'红山堡'}, {name:'酒泉',value:'编组站,客运,一级'}],
			[{name:'酒泉'}, {name:'嘉峪关',value:'编组站,客运,一级'}],
			[{name:'嘉峪关'}, {name:'黑山湖',value:'编组站,客运,一级'}],
			[{name:'黑山湖'}, {name:'玉门东',value:'编组站,客运,一级'}],
			[{name:'玉门东'}, {name:'腰泉子',value:'编组站,客运,一级'}],
			[{name:'腰泉子'}, {name:'五华山',value:'编组站,客运,一级'}],
			[{name:'五华山'}, {name:'低窝铺',value:'编组站,客运,一级'}],
			[{name:'低窝铺'}, {name:'玉门',value:'编组站,客运,一级'}],
			[{name:'玉门'}, {name:'三十里井子',value:'编组站,客运,一级'}],
			[{name:'三十里井子'}, {name:'玉门镇',value:'编组站,客运,一级'}],
			[{name:'玉门镇'}, {name:'军垦',value:'编组站,客运,一级'}],
			[{name:'军垦'}, {name:'疏勒河',value:'编组站,客运,一级'}],
			[{name:'疏勒河'}, {name:'河东',value:'编组站,客运,一级'}],
			[{name:'河东'}, {name:'桥湾',value:'编组站,客运,一级'}],
			[{name:'桥湾'}, {name:'柳沟',value:'编组站,客运,一级'}],
			[{name:'柳沟'}, {name:'安北',value:'编组站,客运,一级'}],
			[{name:'安北'}, {name:'石板墩',value:'编组站,客运,一级'}],
			[{name:'石板墩'}, {name:'峡口',value:'编组站,客运,一级'}],
			[{name:'峡口'}, {name:'柳园',value:'编组站,客运,一级'}],
			[{name:'柳园'}, {name:'小泉东',value:'编组站,客运,一级'}],
			[{name:'小泉东'}, {name:'大泉',value:'编组站,客运,一级'}],
			[{name:'大泉'}, {name:'照东',value:'编组站,客运,一级'}],
			[{name:'照东'}, {name:'红柳河',value:'编组站,客运,一级'}],
			[{name:'红柳河'}, {name:'天湖',value:'编组站,客运,一级'}],
			[{name:'天湖'}, {name:'尾亚',value:'编组站,客运,一级'}],
			[{name:'尾亚'}, {name:'景峡',value:'编组站,客运,一级'}],
			[{name:'景峡'}, {name:'思甜',value:'编组站,客运,一级'}],
			[{name:'思甜'}, {name:'红旗村',value:'编组站,客运,一级'}],
			[{name:'红旗村'}, {name:'山口',value:'编组站,客运,一级'}],
			[{name:'山口'}, {name:'烟墩',value:'编组站,客运,一级'}],
			[{name:'烟墩'}, {name:'哈密东',value:'编组站,客运,一级'}],
			[{name:'哈密东'}, {name:'盐泉',value:'编组站,客运,一级'}],
			[{name:'盐泉'},  {name:'红光',value:'编组站,客运,一级'}],
			[{name:'红光'}, {name:'哈密南',value:'编组站,客运,一级'}],
			[{name:'哈密南'}, {name:'哈密',value:'编组站,客运,一级'}],
			[{name:'哈密'}, {name:'火石泉',value:'编组站,客运,一级'}],
			[{name:'火石泉'}, {name:'头堡',value:'编组站,客运,一级'}],
			[{name:'头堡'}, {name:'二堡',value:'编组站,客运,一级'}],
			[{name:'二堡'}, {name:'柳树泉',value:'编组站,客运,一级'}],
			[{name:'柳树泉'}, {name:'雅子泉',value:'编组站,客运,一级'}],
			[{name:'雅子泉'}, {name:'了墩',value:'编组站,客运,一级'}],
			[{name:'了墩'}, {name:'十三间房',value:'编组站,客运,一级'}],
			[{name:'十三间房'}, {name:'大步',value:'编组站,客运,一级'}],
			[{name:'大步'}, {name:'红台',value:'编组站,客运,一级'}],
			[{name:'红台'}, {name:'小草湖',value:'编组站,客运,一级'}],
			[{name:'小草湖'}, {name:'红旗坎',value:'编组站,客运,一级'}],
			[{name:'红旗坎'}, {name:'鄯善',value:'编组站,客运,一级'}],
			[{name:'鄯善'}, {name:'红山口',value:'编组站,客运,一级'}],
			[{name:'红山口'}, {name:'巴哥',value:'编组站,客运,一级'}],
			[{name:'巴哥'}, {name:'火焰山',value:'编组站,客运,一级'}],
			[{name:'火焰山'}, {name:'七泉湖',value:'编组站,客运,一级'}],
			[{name:'七泉湖'}, {name:'煤窑沟',value:'编组站,客运,一级'}],
			[{name:'煤窑沟'}, {name:'夏普吐勒',value:'编组站,客运,一级'}],
			[{name:'夏普吐勒'}, {name:'吐鲁番',value:'编组站,客运,一级'}],
			[{name:'吐鲁番'}, {name:'天山',value:'编组站,客运,一级'}],
			[{name:'天山'}, {name:'达板城',value:'编组站,客运,一级'}],
			[{name:'达板城'}, {name:'盐湖',value:'编组站,客运,一级'}],
			[{name:'盐湖'}, {name:'柴窝堡',value:'编组站,客运,一级'}],
			[{name:'柴窝堡'}, {name:'三葛庄',value:'编组站,客运,一级'}],
			[{name:'三葛庄'}, {name:'芨芨槽子',value:'编组站,客运,一级'}],
			[{name:'芨芨槽子'}, {name:'乌拉泊',value:'编组站,客运,一级'}],
			[{name:'乌拉泊'}, {name:'乌鲁木齐',value:'编组站,客运,一级'}],
			[{name:'乌鲁木齐'}, {name:'二宫',value:'编组站,客运,一级'}],
			[{name:'二宫'}, {name:'乌西',value:'编组站,客运,一级'}],
			[{name:'乌西'}, {name:'三坪',value:'编组站,客运,一级'}],
			[{name:'三坪'}, {name:'昌吉',value:'编组站,客运,一级'}],
			[{name:'昌吉'}, {name:'呼图壁',value:'编组站,客运,一级'}],
			[{name:'呼图壁'}, {name:'玛纳斯',value:'编组站,客运,一级'}],
			[{name:'玛纳斯'}, {name:'石河子',value:'编组站,客运,一级'}],
			[{name:'石河子'}, {name:'乌兰乌苏',value:'编组站,客运,一级'}],
			[{name:'乌兰乌苏'}, {name:'沙湾县',value:'编组站,客运,一级'}],
			[{name:'沙湾县'}, {name:'奎屯东',value:'编组站,客运,一级'}],
			[{name:'奎屯东'}, {name:'奎屯',value:'编组站,客运,一级'}],
			[{name:'奎屯'}, {name:'奎屯西',value:'编组站,客运,一级'}],
			[{name:'奎屯西'}, {name:'乌苏',value:'编组站,客运,一级'}],
			[{name:'乌苏'}, {name:'四棵树',value:'编组站,客运,一级'}],
			[{name:'四棵树'}, {name:'古河',value:'编组站,客运,一级'}],
			[{name:'古河'}, {name:'托托',value:'编组站,客运,一级'}],
			[{name:'托托'}, {name:'精河',value:'编组站,客运,一级'}],
			[{name:'精河'}, {name:'水泉子',value:'编组站,客运,一级'}],
			[{name:'水泉子'}, {name:'蘑菇滩',value:'编组站,客运,一级'}],
			[{name:'蘑菇滩'}, {name:'艾比湖',value:'编组站,客运,一级'}],
			[{name:'艾比湖'}, {name:'博乐',value:'编组站,客运,一级'}],
			[{name:'博乐'}, {name:'白房子',value:'编组站,客运,一级'}],
			[{name:'白房子'}, {name:'乌兰达布森',value:'编组站,客运,一级'}],
			[{name:'乌兰达布森'}, {name:'阿拉山口',value:'编组站,客运,一级'}]
    	];
    	var jjData=[
	           [{name:'北京南'}, {name:'亦庄',value:'编组站,客运,一级'}],
	           [{name:'亦庄'}, {name:'永乐',value:'编组站,客运,一级'}],
	           [{name:'永乐'}, {name:'武清',value:'编组站,客运,一级'}],
	           [{name:'武清'}, {name:'天津',value:'编组站,客运,一级'}]
		];

    	var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';

    	var convertData = function (data) {
    	    var res = [];
    	    for (var i = 0; i < data.length; i++) {
    	        var dataItem = data[i];
    	        var fromCoord = geoCoordMap[dataItem[0].name];
    	        var toCoord = geoCoordMap[dataItem[1].name];
    	        if (fromCoord && toCoord) {
    	            res.push({
    	                fromName: dataItem[0].name,
    	                toName: dataItem[1].name,
    	                coords: [fromCoord, toCoord]
    	            });
    	        }
    	    }
    	    return res;
    	};

    	var color = ['#a6c84c', '#ffa022', '#46bee9'];
    	var series = [];
    	[['大西线', BJData],['兰新线', lxData],['京津城际',jjData]].forEach(function (item, i) {
    	    series.push({
    	        name: item[0] + ' ',
    	        type: 'lines',
    	        zlevel: 1,
    	        lineStyle: {
    	            normal: {
    	                color: color[i],
    	                width: 1 
    	            }
    	        },
    	        data: convertData(item[1])
    	    },
    	    {
    	        name: item[0] + ' ',
    	        type: 'lines',
    	        zlevel: 2,
    	        lineStyle: {
    	            normal: {
    	                color: 'black',
    	                width: 2
    	            }
    	        },
    	        data: convertData(item[1])
    	    },
    	    {
    	        name: item[0] + ' ',
    	        type: 'effectScatter',
    	        coordinateSystem: 'geo',
    	        zlevel: 2,
    	        rippleEffect: {
    	            brushType: 'stroke'
    	        },
    	        label: {
    	            normal: {
    	                show: true,
    	                position: 'right',
    	                formatter: '',
    	                textStyle:{
    	                	color:"black"
    	                }
    	            }
    	        },
    	        symbolSize: function (val) {
    	            return 2;
    	        },
    	        itemStyle: {
    	            normal: {
    	                color: 'red'
    	            }
    	        },
    	        data: item[1].map(function (dataItem) {
    	            return {
    	                name: dataItem[1].name,
    	                value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
    	            };
    	        })
    	    });
    	});

    	 option = {
    	    backgroundColor: '#fff',
    	    title : {
    	        text: '线路展示',
    	        left: 'center',
    	        textStyle : {
    	            color: 'blue'
    	        }
    	    },
    	    legend: {
    	        orient: 'vertical',
    	        top: 'bottom',
    	        left: 'center',
    	        data:['大西线','兰新线','京津城际'],
    	        textStyle: {
    	            color: '#0A0A0A'
    	        },
    	        selectedMode: 'multiple'
    	    },
    	    tooltip : {
    	        trigger: 'item',
    	        formatter:function(a){
    	        	return a.seriesName+"</br>"+a.name+" : "+a.value[2];
    	        }        
    	    },
    	    geo: {
    	        map: 'china',
    	        label: {
   	        	 	normal: {
   	                    show: true
    	            },
    	            emphasis: {
    	                show: true
    	            }
    	        },
    	        zoom:2,
    	        roam: true,
    	        itemStyle: {
    	            normal: {
    	               areaColor: '#F0FFF0',
    	                borderColor: '#404a59'
    	            },
    	            emphasis: {
    	                areaColor: '#F0FFF0'
    	            }
    	        }
    	    },
    	    series: series
    	};
    	
    	 var myChart1 = echarts.init(document.getElementById('map'),'macarons');
         myChart1.clear();
         myChart1.setOption(option,true);
        window.onresize = function () {
            //重置容器高宽
            myChart1.resize();
        };
</script>